[
  {
    "bookId": 1,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/6JcwN68/1984.jpg",
    "review": "In '1984', George Orwell paints a chilling picture of a dystopian future where individuality is suppressed, and the government controls every aspect of life. The book explores themes of surveillance, manipulation, and the consequences of unchecked power. Orwell's prose is sharp and evocative, making '1984' a timeless cautionary tale.",
    "totalPages": 328,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Dystopian", "Political", "Social Commentary"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 2,
    "bookName": "Sapiens",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/68DVByk/Sapiens.jpg",
    "review": "Yuval Noah Harari's 'Sapiens' offers a sweeping overview of human history, from the emergence of Homo sapiens to the present day. Through engaging prose and thought-provoking analysis, Harari explores how Homo sapiens became the dominant species on Earth and the impact of human activities on the planet. 'Sapiens' is a fascinating journey through the evolution of humanity.",
    "totalPages": 443,
    "rating": 4.7,
    "category": "Non-fiction",
    "tags": ["History", "Anthropology", "Evolution"],
    "publisher": "Harper",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 3,
    "bookName": "Dune",
    "author": "Frank Herbert",
    "image": "https://i.ibb.co/yPdTzt8/dune.jpg",
    "review": "'Dune' by Frank Herbert is a masterful blend of science fiction and political intrigue set on the desert planet of Arrakis. Herbert's world-building is rich and immersive, drawing readers into a complex universe of warring factions and mystical powers. With its memorable characters and epic scope, 'Dune' is a must-read for fans of speculative fiction.",
    "totalPages": 412,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Adventure", "Politics", "Space Opera"],
    "publisher": "Chilton Books",
    "yearOfPublishing": 1965
  },
  {
    "bookId": 4,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/4Pz79bb/alchemist.jpg",
    "review": "'The Alchemist' by Paulo Coelho is a timeless tale of self-discovery and following one's dreams. Through the journey of Santiago, a young shepherd, Coelho explores themes of destiny, perseverance, and the importance of listening to one's heart. 'The Alchemist' inspires readers to pursue their passions and embrace the unknown.",
    "totalPages": 208,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure", "Inspirational"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 5,
    "bookName": "Matilda",
    "author": "Roald Dahl",
    "image": "https://i.ibb.co/54KvPp2/matilda.jpg",
    "review": "'Matilda' by Roald Dahl is a delightful tale of a young girl with extraordinary powers and a love for books. Dahl's whimsical storytelling and Quentin Blake's illustrations bring Matilda's adventures to life as she navigates the challenges of her unkind family and tyrannical headmistress. 'Matilda' is a heartwarming story about the power of intelligence and imagination.",
    "totalPages": 240,
    "rating": 4.8,
    "category": "Children's Literature",
    "tags": ["Fantasy", "Magic", "Education"],
    "publisher": "Jonathan Cape",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 6,
    "bookName": "Moby Dick",
    "author": "Herman Melville",
    "image": "https://i.ibb.co/B3gxGmH/moby-dick.jpg",
    "review": "'Moby Dick' by Herman Melville is a classic tale of obsession and the relentless pursuit of vengeance. Through the character of Captain Ahab and his quest to hunt down the elusive white whale, Melville explores themes of fate, morality, and the destructive nature of man. 'Moby Dick' is a literary masterpiece that continues to captivate readers with its rich symbolism and timeless storytelling.",
    "totalPages": 624,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Adventure", "Sea Story", "Symbolism"],
    "publisher": "Harper & Brothers",
    "yearOfPublishing": 1851
  },
  {
    "bookId": 7,
    "bookName": "Dracula",
    "author": "Bram Stoker",
    "image": "https://i.ibb.co/XxsB6B9/dracula.jpg",
    "review": "'Dracula' by Bram Stoker is the quintessential vampire novel that has shaped popular culture for generations. Stoker's epistolary narrative style, chilling atmosphere, and unforgettable characters, particularly the enigmatic Count Dracula, continue to thrill and terrify readers. 'Dracula' remains a timeless classic of gothic horror.",
    "totalPages": 418,
    "rating": 4.5,
    "category": "Gothic Horror",
    "tags": ["Vampires", "Supernatural", "Victorian Literature"],
    "publisher": "Archibald Constable and Company",
    "yearOfPublishing": 1897
  },
  {
    "bookId": 8,
    "bookName": "Hamlet",
    "author": "William Shakespeare",
    "image": "https://i.ibb.co/QDGLXsb/hamlet.jpg",
    "review": "Shakespeare's 'Hamlet' is a timeless tragedy that delves into the complexities of human nature and the consequences of indecision. Through the character of Prince Hamlet, Shakespeare explores themes of revenge, madness, and mortality, creating a gripping narrative that continues to resonate with audiences worldwide. 'Hamlet' is a masterpiece of English literature.",
    "totalPages": 432,
    "rating": 4.6,
    "category": "Drama",
    "tags": ["Tragedy", "Psychological", "Existentialism"],
    "publisher": "N/A (Published during Shakespeare's lifetime)",
    "yearOfPublishing": 1603
  },
  {
    "bookId": 9,
    "bookName": "Frankenstein",
    "author": "Mary Shelley",
    "image": "https://i.ibb.co/hBGg596/frankenstein.jpg",
    "review": "'Frankenstein' by Mary Shelley is a groundbreaking work of science fiction that explores the moral implications of playing god and the consequences of unchecked ambition. Through the story of Victor Frankenstein and his creation, the creature, Shelley raises profound questions about identity, responsibility, and the nature of humanity. 'Frankenstein' remains as relevant today as it was upon its publication.",
    "totalPages": 280,
    "rating": 4.4,
    "category": "Gothic Horror",
    "tags": ["Science Fiction", "Morality", "Identity"],
    "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
    "yearOfPublishing": 1818
  },
  {
    "bookId": 10,
    "bookName": "Odyssey",
    "author": "Homer",
    "image": "https://i.ibb.co/KrJfk16/odyssey.jpg",
    "review": "Homer's 'Odyssey' is an epic poem that follows the adventures of Odysseus as he journeys home from the Trojan War. Filled with mythological creatures, gods, and heroic deeds, the 'Odyssey' is a timeless tale of courage, perseverance, and the longing for home. Homer's vivid storytelling and rich imagery continue to captivate readers across the ages.",
    "totalPages": 384,
    "rating": 4.7,
    "category": "Epic Poetry",
    "tags": ["Mythology", "Adventure", "Greek Literature"],
    "publisher": "N/A (Originally oral tradition)",
    "yearOfPublishing": "8th century BCE"
  },
  {
    "bookId": 11,
    "bookName": "Macbeth",
    "author": "William Shakespeare",
    "image": "https://i.ibb.co/VNTYfgY/macbeth.jpg",
    "review": "Shakespeare's 'Macbeth' is a dark and gripping tragedy that explores the corrupting influence of power and ambition. Through the character of Macbeth and his ruthless pursuit of the throne, Shakespeare delves into themes of guilt, fate, and the consequences of one's actions. 'Macbeth' is a haunting portrayal of human frailty and the allure of power.",
    "totalPages": 324,
    "rating": 4.5,
    "category": "Drama",
    "tags": ["Tragedy", "Ambition", "Guilt"],
    "publisher": "N/A (Published during Shakespeare's lifetime)",
    "yearOfPublishing": 1606
  },
  {
    "bookId": 12,
    "bookName": "Inferno",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/JcbJQ94/inferno.jpg",
    "review": "'Inferno' by Dan Brown is a fast-paced thriller that takes readers on a journey through the art, history, and mysteries of Florence and Venice. Professor Robert Langdon races against time to solve a series of puzzles inspired by Dante's 'Inferno' and prevent a catastrophic global event. Brown combines suspenseful storytelling with thought-provoking themes to create an electrifying read.",
    "totalPages": 480,
    "rating": 4.2,
    "category": "Thriller",
    "tags": ["Mystery", "Art History", "Conspiracy"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2013
  }
]